## Importing required libraries

In [3]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

## Reading the file

As the data is in excel format it took some time to load

I left out some unnecessary features in the dataset

Basically, my idea is to identify the trend of the food prices in that particular market

We can also compare the mean prices in diferrent markets

In [2]:
df = pd.read_excel('optimized_india_food_prices.xlsx')
df.head()

         date     market            category      commodity  price
0  1994-01-15      Delhi  cereals and tubers           Rice    8.0
1  1994-01-15      Delhi  cereals and tubers          Wheat    5.0
2  1994-01-15      Delhi  miscellaneous food          Sugar   13.5
3  1994-01-15      Delhi        oil and fats  Oil (mustard)   31.0
4  1994-01-15  Ahmedabad  cereals and tubers           Rice    6.8

In [3]:
df['market'].unique()

array(['Delhi', 'Ahmedabad', 'Shimla', 'Bengaluru', 'Bhopal', 'Mumbai',
       'Bhubaneshwar', 'Hyderabad', 'Agartala', 'Kolkata', 'Shillong',
       'Jaipur', 'Chennai', 'Guwahati', 'Tiruvanantapuram', 'Lucknow',
       'Aizawl', 'Patna', 'Chandigarh', 'Ranchi', 'Raipur', 'Kohima',
       'Amritsar', 'Ludhiana', 'Dehradun', 'Vijaywada', 'Rajkot',
       'Dindigul', 'Kanpur', 'Bhagalpur', 'Hisar', 'Karnal', 'Mandi',
       'Dharwad', 'Nagpur', 'Cuttack', 'Sambalpur', 'Thiruchirapalli',
       'Agra', 'Varanasi', 'Siliguri', 'Indore', 'Dimapur', 'Bathinda',
       'Jodhpur', 'Ernakulam', 'Kota', 'Port Blair', 'Puducherry',
       'Panaji', 'Gurgaon', 'Panchkula', 'Kozhikode', 'T.Puram',
       'Gwalior', 'Jabalpur', 'Rourkela', 'Mayabunder', 'Tirupathi',
       'Kurnool', 'Visakhapatnam', 'Darbhanga', 'Bihar_Gaya',
       'Muzzafarpur', 'Purnia', 'Jagdalpur', 'Bilaspur', 'Durg',
       'Ambikapur', 'Bhuj', 'Surat', 'Dharamshala', 'Solan', 'Mangalore',
       'Mysore', 'Palakkad', 'Thrissur', 'Wayanad', 'Rewa', 'Sagar',
       'Nashik', 'Maharashtra_Pune', 'Imphal', 'Jowai', 'Tura',
       'Balasore', 'Berhampur', 'Jeypore', 'Udaipur', 'Gangtok',
       'Coimbatore', 'Cuddalore', 'Dharmapuri', 'Ramanathapuram',
       'Tirunelveli', 'Vellore', 'Adilabad', 'Karimnagar', 'Jadcherla',
       'Suryapet', 'Warangal', 'Gorakhpur', 'Jhansi', 'Allahabad',
       'Meerut', 'Haridwar', 'Haldwani', 'Rudrapur', 'Rampurhat', 'Malda',
       'Purulia', 'Raiganj', 'Kharagpur', 'Una', 'Hoshangabad', 'Jhabua',
       'Shahdol', 'Ujjain', 'Balangir', 'Baripada', 'Bokaro', 'Gumla',
       'Lohardaga', 'Sahibganj', 'Simdega', 'Bengaluru (east range)',
       'Belagavi', 'Vijayapur', 'Dhavanagere', 'Kalaburagi', 'Shivamogga',
       'Bellary', 'Tumakuru', 'Araria', 'Katihar', 'Khagaria',
       'Madhubani', 'Munger', 'Nawada', 'Motihari', 'Rohtas (sasaram)',
       'Saharsa', 'Samastipur', 'Saran', 'Bilaspur-hp', 'Bharatpur',
       'Bikaner', 'Morena', 'Ajmer', 'Aligarh', 'Bareilly', 'Moradabad',
       'Ayodhya', 'Mirzapur (vindhyanchal)', 'Saharanpur'], dtype=object)

In [12]:
df_metro = df[(df['market'].isin(['Delhi','Mumbai','Chennai','Kolkata']))]

In [16]:
df_metro_sugar = df_metro.loc[df_metro['commodity']=='Sugar']

In [17]:
df_metro_sugar.groupby('market').mean().reset_index().sort_values(by='price',ascending=False)

    market      price
3   Mumbai  27.578481
2  Kolkata  27.397224
1    Delhi  27.232155
0  Chennai  26.076099

In [5]:
df.nunique()

date           331
market         155
category         5
commodity       21
price        14832
dtype: int64

In [6]:
df['commodity'].value_counts()

Sugar                  9600
Rice                   9537
Oil (mustard)          8872
Wheat                  8442
Potatoes               6839
Onions                 6788
Wheat flour            6270
Salt (iodised)         6159
Tomatoes               6152
Lentils (masur)        5945
Lentils                5686
Tea (black)            5637
Oil (sunflower)        5338
Oil (groundnut)        4826
Lentils (moong)        4584
Lentils (urad)         4560
Sugar (jaggery/gur)    4446
Oil (palm)             4334
Ghee (vanaspati)       4319
Oil (soybean)          3632
Chickpeas               998
Name: commodity, dtype: int64

## Questions

1.why I have chosen this dataset?

2.what is ths business value?

3.who is my target auidence?

4.what is the purpose of this project?

5.what is the end product?

6.what are the tools I am gonna use?

7.should this project worth the time doing it

1.I need to show people the trend of food prices in India across different markets.

2.I need to show the price fluctutation and identify what is the reason

3.How the prices deviates from one market to other and identify why?

4.Time series analysis on date and prices

5.How the prices differing across various seasons. Seasonal impact on prices

6.Is cost of living and economy of that market a factor for price

7.categorize oils and indentify prices

8.rice,wheat

9.potatao,onion,tomato

10.sugar

In [7]:
df_sugar = df.loc[df['commodity']=='Sugar']

In [8]:
df_sugar.shape

(9600, 5)

In [9]:
df_sugar.head()

          date     market            category commodity  price
2   1994-01-15      Delhi  miscellaneous food     Sugar  13.50
6   1994-01-15  Ahmedabad  miscellaneous food     Sugar  13.50
9   1994-01-15     Shimla  miscellaneous food     Sugar  13.75
12  1994-01-15  Bengaluru  miscellaneous food     Sugar  13.20
15  1994-01-15     Bhopal  miscellaneous food     Sugar  13.25

In [10]:
df_sugar_mean = df_sugar.groupby('market').mean().reset_index().sort_values(by = 'price',ascending = False)

In [26]:
df_sugar_mean.nlargest(5,'price')

         market      price
90   Mayabunder  52.995000
59       Imphal  49.814286
107  Port Blair  46.877961
144        Tura  44.971000
69        Jowai  44.854000

In [27]:
df_sugar_mean.nsmallest(5,'price')

               market      price
142  Tiruvanantapuram  22.755266
33            Chennai  26.076099
58          Hyderabad  26.165000
19          Bengaluru  26.229697
64             Jaipur  26.331212

## My focus is on tamilnadu markets

In [4]:
df1 = pd.read_csv('optimised_food_price.csv')
df1.head()

,date,admin1,admin2,market,latitude,longitude,category,commodity,unit,pricetype,currency,price,usdprice
0,1994-01-15,Delhi,Delhi,Delhi,28.67,77.2,cereals and tubers,Rice,KG,actual,INR,8.0,0.25
1,1994-01-15,Delhi,Delhi,Delhi,28.67,77.2,cereals and tubers,Wheat,KG,actual,INR,5.0,0.16
2,1994-01-15,Delhi,Delhi,Delhi,28.67,77.2,miscellaneous food,Sugar,KG,actual,INR,13.5,0.43
3,1994-01-15,Delhi,Delhi,Delhi,28.67,77.2,oil and fats,Oil (mustard),KG,actual,INR,31.0,0.99
4,1994-01-15,Gujarat,Ahmadabad,Ahmedabad,23.03,72.6,cereals and tubers,Rice,KG,actual,INR,6.8,0.22

In [ ]:
df1

In [6]:
df1.shape

(132348, 13)

In [7]:
df1['admin1'].unique()

array(['Delhi', 'Gujarat', 'Himachal Pradesh', 'Karnataka',
       'Madhya Pradesh', 'Maharashtra', 'Orissa', 'Telangana', 'Tripura',
       'West Bengal', 'Meghalaya', 'Rajasthan', 'Tamil Nadu', 'Assam',
       'Kerala', 'Uttar Pradesh', 'Mizoram', 'Bihar', 'Chandigarh',
       'Jharkhand', 'Nagaland', 'Punjab', 'Uttarakhand', 'Andhra Pradesh',
       'Haryana', 'Andaman and Nicobar', 'Puducherry', 'Goa',
       'Chhattisgarh', 'Manipur', 'Sikkim'], dtype=object)

In [10]:
df1.columns

Index(['date', 'admin1', 'admin2', 'market', 'latitude', 'longitude',
       'category', 'commodity', 'unit', 'pricetype', 'currency', 'price',
       'usdprice'],
      dtype='object')

In [12]:
df_tn_tomato_price = df1.loc[(df1['admin1']=='Tamil Nadu')&(df1['commodity']=='Tomatoes')][['date', 'admin1', 'admin2', 'market','price',
       'usdprice']]

In [16]:
df1.loc[(df1['admin1']=='Tamil Nadu')&(df1['commodity']=='Tomatoes')].nunique()

date         104
admin1         1
admin2         9
market         9
latitude       9
longitude      9
category       1
commodity      1
unit           1
pricetype      1
currency       1
price        330
usdprice      67
dtype: int64

In [14]:
df_tn_tomato_price.nunique()

date        104
admin1        1
admin2        9
market        9
price       330
usdprice     67
dtype: int64

In [13]:
df_tn_tomato_price.to_csv('tn_tomato_price.csv',index = False)